{
  "books": [
    {
      "name": "my Love",
      "description": "Ugly Love by Colleen Hoover is an emotional romance novel that explores themes of love, loss, and healing. The story revolves around Tate Collins, a nursing student, and Miles Archer, a pilot with a troubled past. When Tate moves in with her brother, she meets Miles, and they agree to a physical relationship with two rules: no questions about his past and no expectations for the future. However, their arrangement becomes complicated as deeper feelings develop.",
      "author": "hazem",
      "price": "20",
      "category": "love",
      "image": "https://m.media-amazon.com/images/I/61IKJckL1YL._AC_UL480_FMwebp_QL65_.jpg",
      "favourite": "no",
      "id": "5b34"
    },
    {
      "name": "The Psychology of Money",
      "description": "OVER 5 MILLION COPIES SOLD AROUND THE WORLD… The Psychology of Money is the original bestselling classic from the author of the new book, Same as Ever.*",
      "author": "Morgan Housel ",
      "price": "40",
      "category": "success",
      "favourite": "yes",
      "profile": "no",
      "image": "https://m.media-amazon.com/images/I/811Q+Ij6h0L._AC_UL480_FMwebp_QL65_.jpg",
      "id": "4329"
    },
    {
      "name": "Same As Ever",
      "description": " Same As Ever will arm you with a powerful new ability to think about risk and opportunity, and navigate the uncertainty of the future.",
      "author": "Morgan Housel",
      "price": "60",
      "category": "success",
      "image": "https://m.media-amazon.com/images/I/41GdfpV-ojL._SY445_SX342_.jpg",
      "id": "276b",
      "favourite": "yes"
    },
    {
      "name": "Salah Rules",
      "description": " If Salah is your favourite football player then this is the book for you! Discover how he grew up in Gharbia, Egypt playing football for the youth team El Mokawloons to being named the African Footballer of the Year in 2019 by the BBC and CAF. Learn how he spearheaded Liverpool FC to the Champions League title in 2019.  Football Superstars: Salah Rules is written in an upbeat style that is ideal for emerging and reluctant readers. The simple narrative text is supplemented with cartoons and visual jokes. Sections and chapters make the book easy to navigate and fun to dip in and out of. A supporting cast of players, managers, TV pundits – and even the authors themselves – chip in with quotes, jokes and comments to add to the playful and informative fun.",
      "author": "Simon Mugford ",
      "price": "22",
      "category": "sports",
      "favourite": "false",
      "profile": "no",
      "image": "https://m.media-amazon.com/images/I/51KTAPDkyJL._SY445_SX342_.jpg",
      "id": "4951"
    },
    {
      "name": "Programming in C++",
      "description": "Programming in C++ for Engineering and Science",
      "author": "larry nyhoff",
      "price": "70",
      "category": "programming",
      "image": "https://m.media-amazon.com/images/I/61Ea0Wo7LkL._SY466_.jpg",
      "favourite": "false",
      "id": "dc64"
    },
    {
      "name": "The Powerless Trilogy",
      "description": "oppo is my fauvorate phone in egypt",
      "author": "lorren robertson",
      "price": "25",
      "category": "love",
      "image": "https://m.media-amazon.com/images/I/71Hjo1JeEoL.__AC_SX300_SY300_QL70_ML2_.jpg",
      "favourite": "",
      "profile": "no",
      "id": "43b4"
    },
    {
      "name": "You can",
      "description": " Do you often wonder whether you really have it in you to accomplish your goals, to win over obstacles, and to succeed in life? Through the empowering self-help manual You Can, penned to promote personal growth and well-being for anyone ",
      "author": "George Matthew ",
      "price": "12",
      "category": "success",
      "image": "https://m.media-amazon.com/images/I/41AnbvGOT3L._SY445_SX342_.jpg",
      "profile": "no",
      "id": "90ee"
    },
    {
      "name": "Successful People",
      "description": " 100 Things Successful People Do is your guide to successful living. Mixing simple instructions with activities to get you started, whether you are looking to succeed in your family life, at work, in sports, at school or in retirement, you will find mindsets, habits, and techniques here that will help you get the results you want.  100 Things Successful People Do is packed with great ideas for working smart and living well, all carefully chosen to help you achieve any kind of success you can imagine. You will discover the habits that are common to successful people and find out how to use them in your own life.  Every chapter features a new idea that will help you get closer to your goals. Mixing simple descriptions with activities and exercises, you will learn the optimal mindset and habits you need to succeed in work and life.  And this expanded edition now features a brand new section revealing the 10 things that successful people never do.",
      "author": "Nigel Cumberland",
      "price": "55",
      "category": "success",
      "image": "https://m.media-amazon.com/images/I/71a4BOt38uL._SY466_.jpg",
      "id": "5ae2"
    },
    {
      "name": "How to talk",
      "description": "ever be at a loss for words again! Perfect your people skills with his fun, witty and informative guide, containing 92 little tricks to create big success in personal and business relationships. ",
      "author": "Morgan Housel",
      "price": "40",
      "category": "success",
      "image": "https://m.media-amazon.com/images/I/41zsCXuI2jL._SY445_SX342_.jpg",
      "profile": "",
      "id": "4482"
    },
    {
      "name": "History of Egypt",
      "description": "A History of Egypt: From Earliest Times to the Present",
      "author": "jason thompson",
      "price": "32",
      "category": "history",
      "image": "https://m.media-amazon.com/images/I/A1NFrm3xrbL._SY466_.jpg",
      "id": "b19d",
      "favourite": "no"
    },
    {
      "name": "Tools ",
      "description": "his book is a beautifully-illustrated celebration of 140 essential tools, their history, their unique appeal and how they are used by creative people to make just about anything. From the workhorses designed to fuel the industrial revolution to the specialist tools that allow highly-skilled artisans to produce ornate creations, this book shines a light on the most interesting tools found in the workshop of expert craftsman Dom Chinea - popular presenter on the BBC's award-winning The Repair Shop.",
      "author": "Dominic Chinea",
      "price": "85",
      "category": "history",
      "image": "https://m.media-amazon.com/images/I/91MDp6F7mIL._SY466_.jpg",
      "id": "a8fc"
    },
    {
      "name": "Land of palestine",
      "description": "The Hundred Years' War on Palestine, by Rashid Khalidi, explores the prolonged conflict over Palestine through a historical and personal lens, highlighting key moments in the Palestinian struggle against colonial powers. Khalidi, a historian and Palestinian-American, frames the conflict as a \"colonial war,\" viewing the Zionist movement and subsequent creation of Israel as efforts to establish control over Palestinian land, often with the support of British and American powers.",
      "author": "Rashid Khalidi ",
      "price": "95",
      "category": "history",
      "image": "https://m.media-amazon.com/images/I/81fEw8i8omL._SY466_.jpg",
      "id": "bc44",
      "favourite": "yes"
    },
    {
      "name": "5,000 Awesome Facts",
      "description": " From Africa, alligators, and astronauts to zippers, zebras, and Zambonis, this treasure trove of fascinating, fantastic facts will keep fun-seeking 7-to-10-year-olds entertained for hour",
      "author": "National Geographic ",
      "price": "26",
      "category": "kids",
      "profile": "no",
      "image": "https://m.media-amazon.com/images/I/51FeF824z6L._SY445_SX342_.jpg",
      "id": "4e49"
    },
    {
      "name": "Ali A Life",
      "description": " 'Jonathan Eig’s Ali: A Life is the first comprehensive biography worthy of this titanic figure... [Eig] vigorously narrates the story of the man who transformed the landscape of race and sports... Eig also paints Ali’s bouts with vivid detail and captivating sweep... Ali stirs together the sweet and the spicy, the gifts and the failings, the charm and the rage, the grace and the greed, the pride and the ego. Together, they made Ali the transcendent athlete of his age.' -- Aram Goudsouzian ― Washington Post",
      "author": "Jonathan Eig ",
      "price": "25",
      "category": "sports",
      "image": "https://m.media-amazon.com/images/I/81ThXbrBmIL._SY466_.jpg",
      "favourite": "yes",
      "id": "e65f"
    },
    {
      "name": "Diary of wimpy kids",
      "description": " The first book in the global phenomenon from international bestselling author Jeff Kinney 250 million copies of the series sold worldwide!  'Let me get something straight: this is a JOURNAL not a diary... The other thing I want to clear up right away is that this was MOM's idea, not mine.'",
      "author": "Jeff Kinney",
      "price": "10",
      "category": "kids",
      "image": "https://m.media-amazon.com/images/I/51+ny7zH1-L._SY445_SX342_.jpg",
      "profile": "yes",
      "id": "4a98"
    },
    {
      "id": "e4da",
      "name": "computer science",
      "description": "The newest addition to the wildly successful Big Fat Notebook series, with 3.99 million copies in print: a lively, information-packed, and fully illustrated guide to Computer Science and Coding for middle schoolers.",
      "author": "Grant Smith",
      "price": "60",
      "category": "programming",
      "image": "https://m.media-amazon.com/images/I/51D3iTuw-1L._SY445_SX342_.jpg"
    },
    {
      "id": "d84e",
      "name": "Over 100 Recipes for Healthy",
      "description": " Michael Greger brings you truly delicious, nutritious, healthy dishes that will free you from 'dieting' forever. With over one hundred recipes, this gorgeous full-colour cookbook puts into practice the twenty-one weight-loss accelerators identified in the bestselling How Not to Diet. From Grain-Stuffed Peppers with Cheesy Tomato Sauce to Crust-Free Pumpkin Pie and Black Forest Chia Pudding, this is the smart way to put an end to counting calories, gimmicky quick-fix diets and expensive diet programmes",
      "author": "Michael Greger ",
      "price": "20",
      "category": "food",
      "image": "https://m.media-amazon.com/images/I/81zxvqsKdwS._SY466_.jpg",
      "favourite": "yes"
    },
    {
      "name": "Carbs& Calorie Count",
      "description": " Now in its 6th year, the #1 bestselling Carbs & Cals book is better than ever! Nationally recognised as the \"carb & calorie counting bible\", our visual method of showing hundreds of food photos makes counting carbs and calories a breeze. The essential resource for diabetes management, weight loss, portion control and healthy eating.",
      "author": "Chris Cheyette",
      "price": "24",
      "category": "food",
      "image": "https://m.media-amazon.com/images/I/81a0qQujlXL._SY466_.jpg",
      "id": "488a"
    },
    {
      "name": "Verity",
      "description": " Lowen Ashleigh is a struggling writer on the brink of financial ruin when she accepts the job offer of a lifetime. Jeremy Crawford, husband of bestselling author Verity Crawford, has hired Lowen to complete the remaining books in a successful series his injured wife is unable to finish.",
      "author": "Colleen Hoover",
      "price": "17",
      "category": "fiction",
      "favourite": "yes",
      "profile": "yes",
      "image": "https://m.media-amazon.com/images/I/51B5Njjh36L._SY445_SX342_.jpg",
      "id": "6d36"
    },
    {
      "id": "be48",
      "name": "The book thief",
      "description": "1939. Nazi Germany. The country is holding its breath. Death has never been busier. Liesel, a nine-year-old girl, is living with a foster family on Himmel Street. Her parents have been taken away to a concentration camp. Liesel steals books. This is her story and the story of the inhabitants of her street when the bombs begin to fall.",
      "author": "Markus Zusak ",
      "price": "26",
      "category": "fiction",
      "image": "https://m.media-amazon.com/images/I/71H52+sSb4L._SY466_.jpg"
    },
    {
      "id": "3453",
      "name": "National Geographic ",
      "description": "The best topics for exploring the secrets of the universe, including planet Earth and all the creatures that live on it, as well as the history, culture and customs of humans everywhere and the technological developments that occur every day, through a set of fixed sections and a set of topics that are renewed in each issue.",
      "author": "National Geographic ",
      "price": "7",
      "category": "kids",
      "image": "https://m.media-amazon.com/images/I/41Tt3kK6eVL._SY445_SX342_.jpg"
    },
    {
      "id": "e334",
      "name": "To Love and Let Go",
      "description": "Rachel beautifully demonstrates that intense love and profound grief are often two halves of the same whole. Her story will break you and lift you up",
      "author": "Rachel Brathen",
      "price": "25",
      "category": "love",
      "image": "https://m.media-amazon.com/images/I/81-+a+QvcPL._SY466_.jpg"
    },
    {
      "id": "1461",
      "name": "Coaching Science",
      "description": "Coaching Science and Coaching Studies courses are appearing in increasing numbers in many universities. The textbooks used in most of these courses are either theoretically based sports science texts or practically based coaching books. The former ar",
      "author": " Tudor Hale",
      "price": "44",
      "category": "sports",
      "image": "https://m.media-amazon.com/images/I/71K8tlrBjIL._SY466_.jpg"
    },
    {
      "name": "Dishoom",
      "description": "An eccentric and charming cookbook from Dishoom, with over 100 recipes from the much-loved restaurants",
      "author": " Naved Nasir",
      "price": "35",
      "category": "food",
      "image": "https://m.media-amazon.com/images/I/81wLQFlEYjL._SY466_.jpg",
      "favourite": "yes",
      "profile": "yes",
      "id": "e4b6"
    },
    {
      "id": "2c2e",
      "name": "hazem Stewart",
      "description": "oppo is my fauvorate phone in egypt",
      "author": "saad",
      "price": "22",
      "category": "kids",
      "image": "https://m.media-amazon.com/images/I/71rKNpd26WL._AC_UL480_FMwebp_QL65_.jpg"
    },
    {
      "name": "7 Steps toliving your best life",
      "description": "MANIFEST is the essential guide for anyone and everyone wanting to feel more empowered in their lives. Self-development coach and 'Queen of Manifesting' Roxie Nafousi will show you how in just seven simple steps you can understand the true art of manifestation and learn how to create the life you have always dreamed of.  Whether you want to attract your soulmate, find the perfect job or your dream home, or simply discover more inner-peace and confidence, MANIFEST will teach you exactly how to get there in just 7 steps . . .  1. Be clear in your vision 2. Remove fear and doubt 3. Align your behaviour 4. Overcome tests from the universe 5. Embrace gratitude without caveats 6. Turn envy into inspiration 7. Trust in the universe  A meeting of science and wisdom, manifesting is a philosophy and a self-development practice to help you reach for your goals, cultivate self-love and live your best life.  Unlock the magic for yourself and begin your journey to turning your dreams into reality. ________  'The face of manifesting in Britain THE TIMES ",
      "author": "Roxie Nafousi",
      "price": "15",
      "category": "success",
      "image": "https://m.media-amazon.com/images/I/715u7p+38+L._SY466_.jpg",
      "favourite": "",
      "profile": "no",
      "id": "fe91"
    },
    {
      "id": "29e8",
      "name": "Ikigai",
      "description": "  “Workers looking for more fulfilling positions should start by identifying their ikigai.” ―Business Insider   “One of the unintended―yet positive―conse",
      "author": "Héctor García",
      "price": "968",
      "category": "success",
      "image": "https://m.media-amazon.com/images/I/71xH0ALI4-L._SY466_.jpg",
      "favourite": "yes",
      "profile": ""
    }
  ]
}